# Работа с данными в pandas

задание 1

In [1]:
import pandas as pd
import numpy as np
authors = pd.DataFrame({'authors_id':[1,2,3], 'authors_name':['Turgenjev', 'Chehov','Ostrovsky']},columns = ['authors_id','authors_name'])
book = pd.DataFrame({'authors_id':[1,1,1,2,2,3,3], 'book_title':['Отцы и дети', 'Рудин','Дворянское гнездо','Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[400,300, 350, 500, 450,370,290]},columns = ['authors_id','book_title', 'price'])

задание 2

In [2]:
authors_price = pd.merge(authors, book, on = 'authors_id', how = 'outer')
authors_price

   authors_id authors_name            book_title  price
0           1    Turgenjev           Отцы и дети    400
1           1    Turgenjev                 Рудин    300
2           1    Turgenjev     Дворянское гнездо    350
3           2       Chehov      Толстый и тонкий    500
4           2       Chehov       Дама с собачкой    450
5           3    Ostrovsky                 Гроза    370
6           3    Ostrovsky  Таланты и поклонники    290

задание 3

In [3]:
top5 = authors_price.nlargest(5,'price')
top5

   authors_id authors_name         book_title  price
3           2       Chehov   Толстый и тонкий    500
4           2       Chehov    Дама с собачкой    450
0           1    Turgenjev        Отцы и дети    400
5           3    Ostrovsky              Гроза    370
2           1    Turgenjev  Дворянское гнездо    350

задание 4

In [4]:
authors_stat_0 = authors_price.groupby('authors_id').agg({'price': 'max'})
authors_stat_0 = authors_stat_0.rename(columns = {'price':'max_ price'})
authors_stat_1 = authors_price.groupby('authors_id').agg({'price': 'min'})

authors_stat_2 = authors_price.groupby('authors_id').agg({'price': 'mean'})
authors_stat_0

            max_ price
authors_id
1                  400
2                  500
3                  370

In [5]:
authors_stat_1 = authors_stat_1.rename(columns = {'price':'min_ price'})
authors_stat_1

            min_ price
authors_id
1                  300
2                  450
3                  290

In [6]:

authors_stat_2 = authors_stat_2.rename(columns = {'price':'mean_ price'})
authors_stat_2

            mean_ price
authors_id
1                 350.0
2                 475.0
3                 330.0

In [7]:
authors_stat = pd.merge(authors_stat_0, authors_stat_1, on = 'authors_id',how = 'inner' )
authors_stat = pd.merge(authors_stat, authors_stat_2, on = 'authors_id',how = 'inner' )

authors_stat

            max_ price  min_ price  mean_ price
authors_id
1                  400         300        350.0
2                  500         450        475.0
3                  370         290        330.0